"-34" = "There is not enough free space on this disk to complete the operation";
"-35" = "An attempt was made to read or write to a volume which does not exist";
"-36" = "An unexpected I/O error occurred";
"-37" = "An invalid file name was specified";
"-38" = "An attempt was made to a read or write to a file which is no longer open";
"-39" = "An unexpected end-of-file was encountered";
"-40" = "An attempt was made to position the I/O mark before the start of this file";
"-42" = "Too many files open";
"-43" = "File not found";
"-44" = "This disk is write-protected";
"-45" = "This file is locked";
"-46" = "This volume is locked";
"-47" = "This file is in use";
"-48" = "A file with this name already exists";
"-49" = "This file is already in use for writing";
"-50" = "Invalid parameters were detected for an operation";
"-51" = "An invalid reference number was specified for a file operation";
"-54" = "This file could not be opened for writing, probably because it is in use by another application";
"-60" = "The Master Directory block of this volume is damaged";
"-61" = "An attempt to write to this volume failed";
"-100" = "The system Clipboard has not been properly initialized";
"-102" = "No object of that type in scrap";
"-108" = "There is insufficient memory to complete this operation";
"-109" = "NIL master pointer encountered during operation";
"-111" = "Someone attempted an operation on a free block";
"-112" = "Someone attempted to purge a locked or non-purgeable block";
"-116" = "Someone attempted to allocate more memory than the system was willing to provide at this time";
"-117" = "An attempt was made to relocate a locked block";
"-120" = "Directory not found";
"-122" = "An attempt was made to move a folder into one of its own offspring";
"-124" = "A remote volume has been disconnected";
"-192" = "A needed resource could not be found";
"-194" = "An attempt to add a resource failed";
"-199" = "This resource file’s resource map is inconsistent and may be damaged";
"-600" = "No eligible process with specified descriptor";
"-601" = "Not enough room to launch app w/special requirements";
"-607" = "Error returns from Post and Accept";
"-610" = "No user interaction allowed";
"-666" = "An Internet Config preference was unexpectedly missing or unretrievable";
"-667" = "An Internet Config preference could not be set, because another application is accessing the Internet Config preferences";
"-1700" = "Could not make some data into the desired type";
"-1705" = "The specified list item does not exist";
"-1706" = "Need newer version of the AppleEvent manager";
"-1708" = "This Apple Event was unknown to the recipient and could not be processed";
"-1710" = "Mode wasn't NoReply, WaitReply, or QueueReply or Interaction level is unknown";
"-1711" = "The user cancelled Apple Event processing while waiting for a reply or receipt";
"-1712" = "The application timed out while waiting for a response to an Apple Event";
"-1715" = "A required parameter was not accessed";
"-1717" = "No handler in the dispatch tables fits the parameters to AEGetEventHandler or AEGetCoercionHandler";
"-1718" = "The contents of the reply you are accessing have not arrived yet";
"-1719" = "Index is out of range in a put operation";
"-1720" = "An impossible range was encountered during processing of an Apple Event";
"-1723" = "No Apple Event Object Model accessor was available for the requested class and data type";
"-1727" = "Param to AEResolve not of type 'obj '";
"-1728" = "An attempt was made to resolve an Apple Event reference to a non-existent object";
"-1730" = "Attempt to pass empty list as container to accessor";
"-1735" = "Event has been filtered, and should not be propogated";
"-1736" = "Attempt to install Apple Event handler in table for identical class and id";
"-1737" = "Nesting violation while streaming";
"-1738" = "Attempt to convert a stream that has already been converted";
"-1739" = "Attempting to perform an invalid operation on a null descriptor";
"-1761" = "Parameters are from 2 different components";
"-1762" = "Can't connect to scripting system with that ID";
"-2003" = "QuickTime could not find a media handler for this file";
"-2020" = "QuickTime is not available";
"-3153" = "An attempt was made to communicate over a connection that is no longer open";
"-3155" = "An attempt was made to perform a network operation in the wrong state";
"-3162" = "No more data was available. This usually indicates a network connection failure";
"-3178" = "An unspecified network connection error has occurred";
"-3180" = "The network command in progress was cancelled";
"-3200" = "Permission denied";
"-3202" = "No such response";
"-3205" = "An invalid address was specified - please check the host name or IP address and try again";
"-3220" = "The network connection is temporarily unavailable, please try again later";
"-3252" = "Connection aborted by software command (remote server may not be available)";
"-3256" = "Socket is not connected (the other side may have timed out while waiting for the client)";
"-3259" = "Connection timed out";
"-3260" = "Connection refused by server";
"-5000" = "You do not have sufficient privileges to perform this operation";
"-5016" = "A remote file server could not be located";
"-5031" = "Volume is Read-Only";
"-5032" = "Object is M/R/D/W inhibited";
"-5033" = "The folder being shared contains a shared folder";
"-5040" = "Someone tried to change their password to the same password on a mantadory password change";
"-5041" = "The password being set is too short: there is a minimum length that must be met or exceeded";
"-5042" = "The password being used is too old: this requires the user to change the password before log-in can continue";
"-5043" = "The folder being shared is inside a shared folder OR the folder contains a shared folder and is being moved into a shared folder";
"-5044" = "The folder being shared is inside the trash folder";
"-5500" = "Returned by glue";
"-5501" = "Version non-positive";
"-5502" = "Version bigger than call can handle";
"-5550" = "Value returned if Gestalt doesn't know the answer";
"-5551" = "Undefined selector was passed to Gestalt";
"-5552" = "Tried to add an entry that already existed";
"-8738" = "The specified encoding is not supported for this operation";
"-8739" = "The input text is malformed - if Unicode or UTF-8 text, it may have been modified by a non-Unicode-savvy tool";
"-8740" = "A character was found with no mapping in the specified encoding";
"-8745" = "kTECMissingTableErr";
"-8746" = "kTECTableChecksumErr";
"-8747" = "kTECTableFormatErr";
"-8748" = "kTECCorruptConverterErr";
"-8749" = "kTECNoConversionPathErr";
"-8750" = "kTECBufferBelowMinimumSizeErr";
"-8751" = "kTECArrayFullErr";
"-8752" = "kTECBadTextRunErr";
"-8753" = "kTECPartialCharErr";
"-8754" = "One or more characters were encountered that cannot be represented in the desired text encoding";
"-8755" = "kTECIncompleteElementErr";
"-8756" = "kTECDirectionErr";
"-8770" = "kTECGlobalsUnavailableErr";
"-8771" = "kTECItemUnavailableErr";
"-8783" = "kTECUsedFallbacksStatus";
"-8784" = "kTECNeedFlushStatus";
"-8785" = "The output buffer was not large enough to contain the converted text";
"-9807" = "A secure connection could not be established, because the certificate chain is invalid (one or more certificates may be invalid or expired). Please contact your server administrator for assistance";
"-9812" = "A secure connection could not be established, because this server’s root certificate was not signed by a trusted authority. Please contact your server administrator for assistance";
"-9814" = "A secure connection could not be established, becase one or more of the server’s security certificates have expired. Please contact your server administrator for assistance";
"-9815" = "A secure connection could not be established, becase one or more of the server’s security certificates is not yet valid. Please contact your server administrator for assistance";
"-10000" = "An unexpected error occurred while processing an Apple Event";
"-10003" = "An attempt was made to modify a read-only object";
"-10013" = "An attempt to operate on the selection failed, because there is no selection";
"-10014" = "There were multiple objects available, but the operation can only handle a single object";
"-10015" = "An “Undo” event could not be processed";
"-10814" = "No suitable application could be found to open the indicated document";
"-30872" = "There is no printer selected; please check your Print and Fax system preferences";
